app/views/articles/show.html.erb

<% end %> -->
<% if current_user.favourites.length === 0 %>
---
SELECT "favourites".* FROM "favourites" WHERE "favourites"."user_id" = $1  [["user_id", 1]]