app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.user_id = current_user.id

    if @article.save
---
INSERT INTO "articles" ("title", "text", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asdf"], ["text", "asdf"], ["user_id", 1], ["created_at", "2017-08-28 15:26:24.842046"], ["updated_at", "2017-08-28 15:26:24.842046"]]