app/controllers/users_controller.rb

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    session[:user_id] = nil
    User.find(params[:id]).destroy

INSERT INTO "favourites" ("user_id", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["article_id", 1], ["created_at", "2017-08-29 01:47:09.772116"], ["updated_at", "2017-08-29 01:47:09.772116"]]
---
  def add_favourite
    @favourite = current_user.favourites.build(article_id: params[:article_id])
    if @favourite.save